[
    "Information on this site is self-reported by the organisation. The organisation edits and updates information at its convenience. GuideStar India encourages organisations to frequently update their content, especially contact information. The site allows the organisation to upload registration documents, audited accounts, annual report, returns filed with statutory authorities and pictures; which could serve as supporting reference. We request users to report any errors or incorrect information to us by using the feedback link at the bottom of every page. The purpose of this site is to connect users with organisations that best match their search criteria. Users are advised to exercise due diligence before supporting organisations.\n\nBack To Top",
    "State\n\nWest Bengal\n\n \n\n\nDistrict\n\nSouth 24 Parganas\n\n \n\n\n\n\n\n\n\n\n\nBack To Top",
    "Brief Description \n\t1.To support human potential development through education, training & formation viable peoples group with emphasis on children, adolescents, youth and women.2.\tRunning vocational training centre, for Men, women, girls & children.3.\tTo form self help groups for micro credit activity among the marginalized women & adolescent and empower them for self development and self reliance \n\n\n\n\nNumber of Full Time Staff\n15 \n\n\n\n\nNumber of Full Time Volunteers\n10 \n\n\n\n\nYear of Establishment\n2009 \n\n\n\nHead of the Organisation\n\n\n\n\n\n\nName\n \n\n\n\n\n\nDesignation\n \n\n\n\n\n\nEmail\n \n\n\n\n                                     \n                                \n\n\n\n\n\n\n\n\nDEBDAS HALDER \n\n\n\n\n\n\n\n\n\nShow +\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHide -\n\n\n\n\n\n\nBack To Top",
    "If the organisation has put up its needs (volunteer/ staff/ finance/ in-kind), you would find it in the \"Org Profile\" tab under the link \"How to Help\". Please contact the organisation to verify if the need currently exists before you extend support. If the organisation has provided URLs for making donations/making applications for volunteering or careers or to read further, please copy the URL on a separate browser window.\n\nBack To Top"
]